//Скласти опис класу одновимірних масивів рядків, кожен рядок задається довжиною та вказівкою на виділену для нього пам'ять. Передбачити контроль виходу за межі масивів, можливість звернення до окремих рядків масиву по індексах, 
//виконання операцій поелементного зчеплення двох масивів з утворенням нового
//масиву, злиття двох масивів з виключенням елементів, що повторюються, а також
//виведення на екран елементу масиву і всього масиву.

#include <iostream>
#include <cstring>
using namespace std;

class StringArray
{

	private:
	char** arr;
	int size;
	int* length;
	public:

};